import Accordion from "@/components/Accordion";
import Breadcrumbs from "@/components/Breadcrumbs"

const page = () => {

  const breadcrumbs = [
    { label: "หน้าแรก", href: "/" },
    { label: "ข้อมูลหน่วยงาน", href: "/about/structure" },
    { label: "อำนาจหน้าที่", isCurrent: true },
  ];

  const accordionItems = [
    {
      title: "ฝ่ายบริหารงานทั่วไป",
      content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบาย การควบคุมกำกับดูแล และอำนวยการดำเนินงานของงานบริหารทั่วไป และงานการเงินและบัญชี",
      link: { href: "/departments/general", label: "ไปยังฝ่ายบริหารงานทั่วไป" },
    },
    {
      title: "ส่วนส่งเสริมสาธารณสุข",
      content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบาย การควบคุมกำกับดูแลและอำนวยการดำเนินงานของฝ่ายวิชาการและการประเมินผล ฝ่ายส่งเสริมสาธารณสุข",
      link: { href: "/departments/health-promotion", label: "ไปยังส่วนส่งเสริมสาธารณสุข" },
    },
    {
      title: "ส่วนบริการอนามัยสิ่งแวดล้อม",
      content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบายการควบคุมกำกับดูแล และอำนวยการดำเนินงานของฝ่ายจัดการมูลฝอยและสิ่งปฏิกูล",
      link: { href: "/departments/health-services", label: "ไปยังส่วนบริการอนามัยสิ่งแวดล้อม" },
    },
    {
      title: "ส่วนส่งเสริมอนามัยสิ่งแวดล้อม",
      content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบายการควบคุมกำกับดูแล และอำนวยการดำเนินงานของฝ่ายควบคุมและจัดการคุณภาพสิ่งแวดล้อม",
      link: { href: "/departments/health-promotion", label: "ไปยังส่วนส่งเสริมอนามัยสิ่งแวดล้อม" },
    },
  ];

  return (
    <div className="flex flex-col px-10 py-5 xl:px-20 xl:py-10">
      <Breadcrumbs items={breadcrumbs} />
      <div>
        <div className="my-3">
          <h1 className="sm:text-3xl text-2xl font-bold">อำนาจหน้าที่</h1>
          <div className="flex w-full flex-col border-opacity-50">
            <div className="divider"></div>
          </div>
          <p>สำนักสาธารณสุขและสิ่งแวดล้อม เทศบาลนครนนทบุรี มีหน้าที่ความรับผิดชอบเกี่ยวกับงานการศึกษา ค้นคว้า วิจัย วิเคราะห์และจัดทำแผนงานด้านสาธารณสุข
            งานส่งเสริมสุขภาพ งานป้องกันเฝ้าระวังและควบคุมโรคติดต่อและโรคไม่ติดต่อ งานสุขาภิบาลในสถานประกอบการ งานสุขาภิบาลชุมชน งานคุ้มครองผู้บริโภค
            งานให้บริการด้านสาธารณสุข งานเภสัชกรรม  งานพยาธิวิทยา งานรังสีวิทยา งานวิชาการทางการแพทย์ งานวิเคราะห์ทางวิทยาศาสตร์ งานการแพทย์
            งานการแพทย์ฉุกเฉิน งานรักษาพยาบาล งานศูนย์บริการสาธารณสุข งานโรงพยาบาลส่งเสริมสุขภาพตำบล  งานบริหารสาธารณสุข งานส่งเสริมป้องกันควบคุมโรค
            งานเวชปฏิบัติครอบครัว งานหลักประกันสุขภาพ  งานมาตรฐานและคุณภาพหน่วยบริการ งานยุทธศาสตร์สาธารณสุข งานกฎหมายสาธารณสุข งานแพทย์แผนไทย
            งานส่งเสริมสนับสนุนการแพทย์แผนไทย งานกายภาพและอาชีวบำบัด งานฟื้นฟูสมรรถภาพและจิตใจผู้ป่วย งานทันตสาธารณสุข งานบริการรักษาความสะอาด
            งานบริการและพัฒนาระบบจัดการมูลฝอย งานบริหารจัดการสิ่งปฏิกูล งานส่งเสริมสนับสนุนการพัฒนาคุณภาพชีวิตเด็ก สตรี ผู้สูงอายุ ผู้พิการ และผู้ด้อยโอกาสงานอาสาสมัครสาธารณสุข
            งานป้องกันและบำบัดการติดสารเสพติด งานสัตวแพทย์ งานศึกษาค้นคว้า  วิเคราะห์ วิจัย วิเคราะห์กำหนดมาตรการและแผนดำเนินงานด้านสิ่งแวดล้อม การประเมินผลกระทบด้านสิ่งแวดล้อม
            การเฝ้าระวังและตรวจสอบคุณภาพสิ่งแวดล้อม งานส่งเสริมสนับสนุนด้านสิ่งแวดล้อมงานจัดทำและพัฒนาระบบฐานข้อมูลด้านการจัดการสิ่งแวดล้อม งานรณรงค์และการฝึกอบรมสร้างจิตสำนึกด้านสิ่งแวดล้อม
            งานวางแผนและจัดทำแผนดำเนินงานด้านการเฝ้าระวัง ควบคุมมลพิษทางน้ำ อากาศ และเสียง งานเฝ้าระวัง บำบัด ตรวจสอบคุณภาพน้ำ อากาศ ของเสียและสารอันตรายต่าง ๆ
            งานบริการข้อมูล สถิติ ช่วยเหลือให้คำแนะนำทางวิชาการ และงานอื่น ๆ ที่เกี่ยวข้องและที่ได้รับมอบหมาย  มีผู้อำนวยการสาธารณสุขและสิ่งแวดล้อมควบคุมการปฏิบัติงาน ดังนี้</p>
        </div>
        <div className="flex flex-col gap-4 lg:gap-6 pt-4 lg:pt-6">
          {accordionItems.map((item, index) => (
            <Accordion
              key={index}
              title={item.title}
              content={item.content}
              link={item.link}
              name="roles-accordion" // กำหนด group name เพื่อใช้ควบคุม radio
            />
          ))}
        </div>
      </div>
    </div>
  )
}

export default page