export const contactData = [
    {
      title: "เบอร์โทรศัพท์",
      details: [
        {
          label: "ผู้อำนวยการสำนักการสาธารณสุขฯ",
          numbers: ["02-591-5180", "02-589-0500 ต่อ 1219,1220"],
        },
        {
          label: "ผู้อำนวยการส่วนบริการสาธารณสุขฯ",
          numbers: ["02-589-0500 ต่อ 1204"],
        },
        {
          label: "ผู้อำนวยการส่วนบริการส่งเสริมอนามัยสิ่งแวดล้อม",
          numbers: ["02-589-0500 ต่อ 1206"],
        },
        {
          label: "สำนักการสาธารณสุขฯ",
          numbers: ["02-580-0503", "02-580-0867"],
        },
        {
          label: "ส่วนบริการอนามัยสิ่งแวดล้อม",
          numbers: ["02-589-0500 ต่อ 1202"],
        },
        {
          label: "สูบสิ่งปฏิกูล",
          numbers: ["02-589-0503"],
        },
        {
          label: "กลุ่มงานบริการสูบสิ่งปฏิกูล",
          numbers: ["02-589-0500 ต่อ 1203"],
        },
        {
          label: "งานวิชาการ",
          numbers: ["02-589-0500 ต่อ 1218"],
        },
        {
          label: "งานสุขาภิบาล",
          numbers: ["02-589-0500 ต่อ 1207"],
        },
        {
          label: "งานส่งเสริมสุขภาพ",
          numbers: ["02-589-0500 ต่อ 1214"],
        },
        {
          label: "งานป้องกันและควบคุมโรค",
          numbers: ["02-589-0500 ต่อ 1209"],
        },
        {
          label: "หัวหน้าฝ่ายสุขาภิบาลและคุณภาพสิ่งแวดล้อม",
          numbers: ["02-589-0500 ต่อ 1212"],
        },
        {
          label: "งานทรัพยากรธรรมชาติ",
          numbers: ["02-589-0500 ต่อ 1210"],
        },
        {
          label: "งานธุรการ",
          numbers: ["02-589-0500 ต่อ 1223,1225"],
        },
        // เพิ่มข้อมูลตามที่คุณต้องการ
      ],
    },
  ];