export const academicEvaluationDepartment = {
    title: "1. ฝ่ายวิชาการและการประเมินผล",
    content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบาย การควบคุมกำกับดูแล และอำนวยการดำเนินงานของ งานนโยบายและแผนงานสาธารณสุข งานวิชาการ และบริการข้อมูลงานติดตามและประเมินผล ดังนี้",
    items: [
        {
            title: "1.1 งานนโยบายและแผนงานสาธารณสุข ",
            content: null,
            subItems: [
                { content: "จัดทำแผนงานด้านสาธารณสุขและสิ่งแวดล้อม แผนยุทธศาสตร์การพัฒนา แผนพัฒนาท้องถิ่น แผนดำเนินงานประจำปี" },
                { content: "แผนการจัดหาบุคลากร กรอบอัตรากำลัง" },
                { content: "จัดทำและประสานแผนดำเนินกิจกรรม/ โครงการของส่วนราชการต่าง ๆ ในรูปแบบแผนงานหลักของสำนักสาธารณสุขและสิ่งแวดล้อม" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.2 งานวิชาการและบริการข้อมูล",
            content: null,
            subItems: [
                { content: "การปฏิบัติงานด้านสารบรรณและธุรการทั่วไป" },
                { content: "งานบริการข้อมูล สถิติ และวิชาการต่าง ๆ ด้านสาธารณสุขและสิ่งแวดล้อม" },
                { content: "พัฒนาระบบฐานข้อมูลสารสนเทศให้เป็นปัจจุบันอย่างต่อเนื่อง" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.3 งานติดตามและประเมินผล",
            content: null,
            subItems: [
                { content: "ติดตามและประเมินผลโครงการด้านสาธารณสุขและสิ่งแวดล้อม" },
                { content: "ติดตามและประเมินผลแผนพัฒนาท้องถิ่น แผนการดำเนินงานประจำปีงบประมาณและแผนต่าง ๆ ที่เกี่ยวข้องกับภารกิจของสำนัก อาทิ แผนป้องกันการทุจริตแผนบริหารความเสี่ยง เป็นต้น" },
                { content: "ประสานงาน ประเมินผลการปฏิบัติงานตามภารกิจด้านสาธารณสุขและสิ่งแวดล้อมตามตัวชี้วัดการประเมินผลที่เกี่ยวข้อง อาทิ การประเมินผลการปฏิบัติราชการตามคำรับรองการปฏิบัติราชการประจำปี การประเมินประสิทธิภาพการปฏิบัติราชการขององค์กรปกครองส่วนท้องถิ่น การประเมินผู้บริหารท้องถิ่น การประเมินประสิทธิภาพและประสิทธิผลการปฏิบัติราชการเพื่อเสนอขอรับเงินรางวัลประจำปี การประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ เป็นต้น" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
    ],
};

export const publicHealthPromotionDepartment = {
    title: "2. ฝ่ายส่งเสริมสาธารณสุข",
    content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบาย การควบคุมกำกับดูแล และอำนวยการดำเนินงานของงานหลักประกันสุขภาพ งานส่งเสริมคุณภาพชีวิตผู้สูงอายุ งานอาสาสมัครสาธารณสุข และงานเผยแพร่และฝึกอบรมด้านสาธารณสุข ดังนี้",
    items: [
        {
            title: "2.1 งานหลักประกันสุขภาพ",
            content: null,
            subItems: [
                { content: "การดำเนินงานและบริหารจัดการระบบหลักประกันสุขภาพในระดับท้องถิ่นหรือพื้นที่ โดยให้มีกองทุนหลักประกันสุขภาพที่มีวัตถุประสงค์เพื่อสนับสนุนและส่งเสริม การจัดบริการสาธารณสุขของหน่วยบริการ สถานบริการหน่วยงาน สาธารณสุข หน่วยงานอื่น องค์กรหรือกลุ่มประชาชน" },
                { content: "ดำเนินงานบริการสาธารณสุขสำหรับผู้สูงอายุที่มีภาวะพึ่งพิงและบุคคลอื่นที่มีภาวะพึ่งพิง" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
        {
            title: "2.2 งานส่งเสริมคุณภาพชีวิตผู้สูงอายุ",
            content: null,
            subItems: [
                { content: "วางแผน สนับสนุนการพัฒนาคุณภาพชีวิตผู้สูงอายุ" },
                { content: "การให้บริการและดำเนินการด้านการส่งเสริมคุณภาพชีวิตผู้สูงอายุ" },
                { content: "กำกับดูแลศูนย์พัฒนาคุณภาพชีวิตผู้สูงอายุ เทศบาลนครนนทบุรี และศูนย์สาขา" },
                { content: "วิเคราะห์ วิจัย หรือจัดทำแผนด้านการส่งเสริมคุณภาพชีวิตผู้สูงอายุในพื้นที่" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
        {
            title: "2.3 งานอาสาสมัครสาธารณสุข",
            content: null,
            subItems: [
                { content: "วางแผน ส่งเสริม พัฒนารูปแบบและดำเนินงานสาธารณสุขมูลฐาน" },
                { content: "พัฒนาศักยภาพ นิเทศ ติดตาม ส่งเสริม และสนับสนุนการมีส่วนร่วมของอาสาสมัครสาธารณสุข องค์กรภาคประชาชน และประชาชนในการดูแลสุขภาพด้วยตนเอง" },
                { content: "ถ่ายทอดความรู้และเทคโนโลยีที่เกี่ยวข้องกับสาธารณสุขมูลฐานและความรู้ด้านสุขภาพ" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
        {
            title: "2.4 งานเผยแพร่และฝึกอบรมด้านสาธารณสุข",
            content: null,
            subItems: [
                { content: "จัดทำแผนการเผยแพร่และฝึกอบรมให้สอดคล้องกับนโยบายสุขภาพทุกระดับทั้งระดับประเทศ ระดับจังหวัด ระดับพื้นที่ สภาพปัญหา ความเร่งด่วน และความต้องการของประชาชนในพื้นที่" },
                { content: "ดำเนินโครงการที่เกี่ยวข้องด้านสาธารณสุข ครอบคลุมประชากรทุกกลุ่มเป้าหมาย เช่น วัยเด็ก วัยเรียน วัยทำงาน วัยผู้สูงอายุ สตรี ผู้พิการ ผู้ด้อยโอกาส เป็นต้น ในลักษณะโครงการภาพรวมในพื้นที่" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
        {
            title: "2.5 งานสัตวแพทย์",
            content: null,
            subItems: [
                { content: "จัดบริการทางด้านสัตวแพทย์ เช่น ตรวจรักษาโรค ทำหมัน ฉีดยาคุมกำเนิด ฉีดวัคซีนป้องกันโรคพิษสุนัขบ้า ฯลฯ ให้แก่สัตว์เลี้ยงในคลินิกสัตวแพทย์ เทศบาลนครนนทบุรี" },
                { content: "ส่งเสริมการเลี้ยงสัตว์ให้ถูกวิธี บริการตรวจสุขภาพและให้คำปรึกษาด้านสุขภาพสัตว์" },
                { content: "งานควบคุมโรคสัตว์สู่คน เฝ้าระวังควบคุมแหล่งเกิดโรค" },
                { content: "รับเรื่องราว ตรวจสอบและแก้ไขปัญหาเรื่องร้องเรียนร้องทุกข์ที่เกี่ยวกับสัตว์ในพื้นที่สาธารณะ" },
                { content: "ควบคุมการฆ่าสัตว์และจำหน่ายเนื้อสัตว์ให้เป็นไปตามกฎหมายว่าด้วยการควบคุม และจำหน่ายเนื้อสัตว์" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "2.6 งานส่งเสริมสุขภาพ",
            content: null,
            subItems: [
                { content: "วางแผนและดำเนินการด้านส่งเสริมสุขภาพทุกกลุ่มวัย" },
                { content: "งานโภชนาการ" },
                { content: "งานอนามัยชุมชน งานวางแผนครอบครัว ให้สุขศึกษา" },
                { content: "วางแผนและพัฒนาพฤติกรรมสุขภาพจิตของประชาชน" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "2.7 งานป้องกันและควบคุมโรค",
            content: null,
            subItems: [
                { content: "วางแผนและดำเนินงานเกี่ยวกับการป้องกันและควบคุมโรคติดต่อ โรคอุบัติใหม่" },
                { content: "วางแผนและดำเนินงานเกี่ยวกับการป้องกันและควบคุมโรคไม่ติดต่อ" },
                { content: "วางแผนและดำเนินงานเกี่ยวกับการป้องกันและบำบัดการติดสารเสพติด" },
                { content: "วางแผนและดำเนินงานอนามัยโรงเรียน" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
    ],
};

export const generalManagementItems = {
    title: "1. งานบริหารทั่วไป",
    items: [
        {
            content: "ปฏิบัติงานด้านสารบรรณและธุรการทั่วไป",
        },
        {
            content: "จัดทำบัญชีลงรับ - ส่ง หนังสือ การร่างโต้ตอบหนังสือ การจัดทำบันทึกสรุปการประชุม",
        },
        {
            content: "จัดทำประกาศ คำสั่ง การเวียน แจ้งหนังสือ การบันทึกข้อมูล",
        },
        {
            content:
                "การเลื่อนขั้นเงินเดือนการดำเนินการทางวินัย ทะเบียนประวัติ การขอรับบำเหน็จบำนาญและเกษียณอายุ การขอพระราชทานเครื่องราชอิสริยาภรณ์ การประกาศเกียรติคุณ",
        },
        {
            content: "การดำเนินการตามพระราชบัญญัติประกันสังคม พ.ศ. 2533",
        },
        {
            content:
                "การดำเนินการพัสดุ การจัดซื้อ - จัดจ้าง การจัดทำทะเบียนทรัพย์สิน การซ่อมบำรุงครุภัณฑ์ยานพาหนะและสิ่งก่อสร้างของสำนัก",
        },
        {
            content: "การโอนงบประมาณรายจ่ายประจำปี",
        },
        {
            content: "งานเกี่ยวกับการจัดทำฎีกา และควบคุมงบประมาณ",
        },
        {
            content: "งานอื่นที่เกี่ยวข้องหรือตามที่ได้รับมอบหมาย",
        },
    ],
};

export const financeItems = {
    title: "2. งานการเงินและบัญชี",
    items: [
        {
            content: "จัดทำบัญชีเงินเดือน การเบิกจ่ายงบประมาณ",
        },
        {
            content: "การจัดทำบัญชีรับ – จ่ายของสำนักสาธารณสุขและสิ่งแวดล้อม ",
        },
        {
            content: "งานอื่นที่เกี่ยวข้องหรือที่ได้รับมอบหมาย ",
        }
    ],
};

export const wasteManagementDepartment = {
    title: "1. ฝ่ายจัดการมูลฝอยและสิ่งปฏิกูล",
    content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบายการควบคุมกำกับดูแล และอำนวยการดำเนินงานของงานบริการรักษาความสะอาด งานบริหารจัดการมูลฝอย งานพัฒนาระบบจัดการมูลฝอย และงานบริหารจัดการสิ่งปฏิกูล ดังนี้",
    items: [
        {
            title: "1.1 งานบริการรักษาความสะอาด",
            content: null,
            subItems: [
                { content: "ดูแลรักษาความสะอาดทั่วไป บริหารบุคลากรด้านรักษาความสะอาด เก็บกวาดล้างท่อ ทำความสะอาดถนน ทางเท้า ทางน้ำ ที่สาธารณะ พัฒนาพื้นที่รกร้างว่างเปล่า การดูแล/บำรุงรักษาเครื่องจักรกลและอุปกรณ์รักษาความสะอาด" },
                { content: "วางแผน จัดทำ พัฒนาแผนการรักษาความสะอาดคูคลองสาธารณะ" },
                { content: "กำจัดผักตบชวา วัชพืชในคูคลองลำรางสาธารณะ" },
                { content: "ส่งเสริมการมีส่วนร่วมของประชาชนในการรักษาความสะอาด" },
                { content: "วางแผน ควบคุม กำหนดมาตรการและแผนการให้บริการในการบริการรักษาความสะอาด" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.2 งานบริหารจัดการมูลฝอย",
            content: null,
            subItems: [
                { content: "กำหนดมาตรการและแผนการให้บริการเก็บขนมูลฝอย" },
                { content: "บริหารบุคลากรด้านการจัดการมูลฝอย" },
                { content: "วิเคราะห์และจัดหาครุภัณฑ์ให้เพียงพอต่อการปฏิบัติงานให้บริการจัดการมูลฝอย" },
                { content: "ส่งเสริมสมรรถนะและการบริหารจัดการมูลฝอย " },
                { content: "ส่งเสริมการมีส่วนร่วมของประชาชนในการจัดการมูลฝอย" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.3 งานพัฒนาระบบจัดการมูลฝอย",
            content: null,
            subItems: [
                { content: "ปฏิบัติงานด้านวิชาการ การศึกษา รวบรวมข้อมูล วิเคราะห์สภาพปัญหา" },
                { content: "พัฒนาระบบการจัดการมูลฝอยให้ครอบคลุมมูลฝอยทุกประเภท" },
                { content: "จัดทำแผนต่าง ๆ ที่เกี่ยวข้องกับการจัดการมูลฝอย เช่น แผนพัฒนาท้องถิ่น แผนอัตรากำลัง แผนการจัดซื้อจัดจ้าง แผนติดตามและประเมินผล" },
                { content: "รวบรวมข้อมูล จัดทำรายงานเพื่อรองรับการประเมินของหน่วยงาน" },
                { content: "จัดทำสื่อประชาสัมพันธ์ เผยแพร่ข้อมูลข่าวสาร รณรงค์ ฝึกอบรมให้ความรู้ เกี่ยวข้องกับการจัดการมูลฝอย" },
                { content: "จัดทำโครงการรณรงค์ส่งเสริมการจัดการมูลฝอย สร้างเครือข่ายความร่วมมือ กับประชาชน องค์กร สถาบันการศึกษาทั้งในและต่างประเทศ" },
                { content: "งานแปรสภาพมูลฝอย ส่งเสริมการนำมูลฝอยมาใช้ประโยชน์" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.4 งานบริหารจัดการสิ่งปฏิกูล",
            content: null,
            subItems: [
                { content: "ส่งเสริม สนับสนุน กำหนดมาตรฐานและแผนการให้บริการจัดการสิ่งปฏิกูล การบำบัดสิ่งปฏิกูล และการลอกท่อระบายน้ำ" },
                { content: "ให้บริการเก็บขนสิ่งปฏิกูล บำบัดสิ่งปฏิกูล และลอกท่อระบายน้ำ" },
                { content: "เฝ้าระวังด้านการสุขาภิบาลส้วมสาธารณะ" },
                { content: "ตรวจสอบวิเคราะห์คุณภาพน้ำจากระบบบำบัดสิ่งปฏิกูล" },
                { content: "จัดให้มีศูนย์การเรียนรู้ด้านการจัดการสิ่งปฏิกูลในพื้นที่" },
                { content: "ให้บริการสนับสนุนรถสุขาเคลื่อนที่" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
    ],
};

export const envQualityDept = {
    title: "1. ฝ่ายควบคุมและจัดการคุณภาพสิ่งแวดล้อม",
    content: "มีหน้าที่รับผิดชอบเกี่ยวกับการกำหนดนโยบายการควบคุมกำกับดูแล และอำนวยการดำเนินงานของงานสุขาภิบาลสถานประกอบการ งานสุขาภิบาลชุมชนเมืองและเหตุรำคาญ งานคุ้มครองผู้บริโภค งานเฝ้าระวังและตรวจสอบคุณภาพสิ่งแวดล้อม และงานจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม ดังนี้",
    items: [
        {
            title: "1.1 งานสุขาภิบาลสถานประกอบการ",
            content: null,
            subItems: [
                { content: "วางแผนจัดทำแผนปฏิบัติการด้านสุขาภิบาลอาหารและน้ำในสถานประกอบการ จำหน่ายอาหาร ร้านอาหาร หาบเร่ แผงลอย ตลาดสด แหล่งผลิตอาหาร และสถานบริการ" },
                { content: "การติดตาม ตรวจสอบและควบคุมการอนุญาตในสถานที่จำหน่ายหรือสะสมอาหาร และเครื่องดื่ม" },
                { content: "การพัฒนาและปรับปรุงยกระดับมาตรฐานการสุขาภิบาลในสถานประกอบการ ร้านจำหน่ายอาหาร หาบเร่-แผงลอย ตลาดสด ร้านอาหารในโรงเรียน" },
                { content: "งานฝึกอบรมและเผยแพร่ประชาสัมพันธ์งานสุขาภิบาล" },
                { content: "การจัดทำพัฒนาระบบฐานข้อมูลงานสุขาภิบาลประกอบการค้า" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.2 งานสุขาภิบาลชุมชนเมืองและเหตุรำคาญ",
            content: null,
            subItems: [
                { content: "การวางแผน การจัดทำ การตรวจสอบ ปรับปรุงแก้ไข ยกระดับมาตรฐานด้านสุขาภิบาลทั่วไปสำหรับสถานบริการ โรงงาน ชุมชนและกิจการที่เป็นอันตราย ต่อสุขภาพ การติดตาม ตรวจสอบ กิจการที่เป็นอันตรายต่อสุขภาพ" },
                { content: "งานอาชีวอนามัยและความปลอดภัยในสถานประกอบการ" },
                { content: "การวางแผนและควบคุมการดำเนินงานด้านสุสานและฌาปนสถาน" },
                { content: "การรับเรื่องราว ร้องทุกข์และติดตาม ตรวจสอบ และแก้ไขเหตุเดือดร้อนรำคาญ" },
                { content: "การวางแผน การควบคุม ป้องกันการร้องทุกข์เกี่ยวกับเหตุเดือดร้อนรำคาญ" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.3 งานคุ้มครองผู้บริโภค",
            content: null,
            subItems: [
                { content: "การวางแผน การจัดทำแผนปฏิบัติการคุ้มครองผู้บริโภค ด้านน้ำ อาหาร ยารักษาโรค และเครื่องสำอาง" },
                { content: "การส่งเสริมประชาสัมพันธ์ให้ประชาชน องค์กร มีความตระหนักในการบริโภคน้ำ อาหาร การใช้ยารักษาโรค และเครื่องสำอางที่ปลอดภัย" },
                { content: "การคุ้มครองและปกป้องสิทธิผู้บริโภค" },
                { content: "งานวิเคราะห์ ตรวจสอบคุณภาพ เฝ้าระวัง อาหารและเครื่องดื่ม" },
                { content: "ควบคุมการจำหน่ายยารักษาโรคและเครื่องสำอาง" },
                { content: "การรับเรื่องราวร้องทุกข์ ประสานการแก้ไข การประสานความร่วมมือกับภาคีต่าง ๆ และประชาชนในการดำเนินงานคุ้มครองผู้บริโภค" },
                { content: "จัดทำและพัฒนาระบบฐานข้อมูลคุ้มครองผู้บริโภค" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.4 งานเฝ้าระวังและตรวจสอบคุณภาพสิ่งแวดล้อม",
            content: null,
            subItems: [
                { content: "วางแผน จัดทำแผนปฏิบัติการเฝ้าระวัง และควบคุมมลพิษทางน้ำ อากาศ และเสียง ตรวจสอบ ควบคุม และดำเนินการแก้ไขแหล่งกำเนิดมลพิษต่าง ๆ" },
                { content: "ดำเนินงานตรวจสอบและแก้ไขเรื่องร้องเรียนร้องทุกข์ด้านมลพิษต่าง ๆ" },
                { content: "ดำเนินงานตามภารกิจถ่ายโอน การตรวจสอบและออกใบอนุญาตสถานีบริการ น้ำมันเชื้อเพลิง และสถานประกอบการต่าง ๆ" },
                { content: "การประสานกับเครือข่ายในการเฝ้าระวัง และควบคุมมลพิษจากสถานประกอบการต่าง ๆ" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
        {
            title: "1.5 งานจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม",
            content: null,
            subItems: [
                { content: "วางแผน จัดทำ พัฒนาแผนยุทธศาสตร์ แผนปฏิบัติการจัดการคุณภาพสิ่งแวดล้อม และการจัดการทรัพยากรธรรมชาติ " },
                { content: "รวบรวมข้อมูล วิเคราะห์ จัดทำรายงานสถานการณ์ด้านสิ่งแวดล้อม และสถานการณ์ด้านการจัดการทรัพยากรธรรมชาติ" },
                { content: "จัดทำและพัฒนาระบบฐานข้อมูลด้านการจัดการสิ่งแวดล้อมและการจัดการทรัพยากรธรรมชาติ" },
                { content: "พัฒนาความร่วมมือ รณรงค์สร้างจิตสำนึก ฝึกอบรม และส่งเสริมการมีส่วนร่วมของประชาชนในการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม" },
                { content: "ปฏิบัติงานอื่น ๆ ที่เกี่ยวข้องหรือที่ได้รับมอบหมาย" },
            ],
        },
    ],
};
